In [3]:
import pandas as pd
import numpy as np

In [4]:
# data = pd.read_csv('https://stepik.org/media/attachments/course/4852/titanic.csv')
data = pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')

In [5]:
data.shape

(1000, 8)

**Запрос query**


У какой доли студентов из датасэта в колонке lunch указано free/reduced?

Формат ответа десятичная дробь, например, 0.25

In [6]:
data['lunch'].value_counts(normalize=True)

standard        0.645
free/reduced    0.355
Name: lunch, dtype: float64

Как различается среднее и дисперсия оценок по предметам у групп студентов со стандартным или урезанным ланчем?

In [7]:
data_student = pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')

In [8]:
data_student.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [9]:
data_student = data_student.rename(columns={
    'gender': 'gender', 'race/ethnicity': 'race/ethnicity', 
    'parental level of education': 'parental_level_of_education', 
    'lunch': 'lunch', 'test preparation course': 'test_preparation_course', 
    'math score': 'math_score', 
    'reading score': 'reading_score', 'writing score': 'writing_score'})

In [15]:
data_student.query("lunch == 'free/reduced'")

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
3,male,group A,associate's degree,free/reduced,none,47,57,44
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50
17,female,group B,some high school,free/reduced,none,18,32,28
...,...,...,...,...,...,...,...,...
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
999,female,group D,some college,free/reduced,none,77,86,86